{
  "header": {
    "start": "Home",
    "about": "About",
    "projects": "Projects",
    "experience": "Experience",
    "contacts": "Contact",
    "download_cv": "Download Resume (en-US)"
  },
  "texts": {
    "hello_visitor": "Hello and welcome!",
    "my_name": "I'm Welder",
    "job_title": "Front-end Developer"
  },
  "about": {
    "image_alt": "cartoon of a programmer",
    "title": "About Me",
    "description_1": "Hello, I’m Welder Barroso — Front-End Developer, Technical degree in Computer Science from IFRR, with approximately three years of experience in web environments. I specialize in JavaScript and TypeScript, leveraging React and Next.js to turn ideas into elegant, high-performance user interfaces. I’m passionate about building dynamic and efficient experiences that combine clean code, thoughtful UI/UX and business-driven outcomes.",
    "description_2": "Main Technologies",
    "download_cv": "Download Resume (en-US)"
  },
  "projects": {
    "title": "Projects",
    "description": "Explore the projects I've worked on. Click the cards for detailed insights into each exciting project.",
    "instagram_app": {
      "title": "Instagram App",
      "description": "An Instagram-themed app with theme switching (light/dark) and integration with a photo API."
    },
    "burger_app": {
      "title": "Burger App",
      "description": "An app for ordering burgers with transitions between screens and the ability to manage orders."
    },
    "weather_forecast": {
      "title": "Weather Forecast",
      "description": "This site fetches weather data for any city, showing current conditions and a 5-day forecast."
    },
    "login_fotografia": {
      "title": "Photography Login",
      "description": "A themed login page created for a job application, which helped me land my first role."
    },
    "login_dark": {
      "title": "Dark Theme Login",
      "description": "A clean, elegant login screen built with HTML and CSS."
    },
    "landing_halloween": {
      "title": "Halloween Landing Page",
      "description": "A fun project to practice animations and responsive design."
    },
    "login_black_white": {
      "title": "Black and White Login Page",
      "description": "A simple login page featuring smooth transition animations."
    },
    "landing_padaria": {
      "title": "Bakery Landing Page",
      "description": "A site designed to refine my styling skills, with an email sending API implementation."
    },
    "senaigame": {
      "title": "Senai Game Activity",
      "description": "A project developed during a Senai course, focusing on HTML, CSS, and JavaScript skills."
    },
    "barbearia": {
      "title": "Barbershop Landing Page",
      "description": "A landing page for a barbershop, created to enhance my design and layout skills."
    }
  },
  "experience": {
    "section": {
      "title": "Professional Experience",
      "subtitle": "My journey in front-end development, focused on building scalable and high-performance web and mobile interfaces. Experienced in technical leadership, optimization, and user experience."
    },
    "pigz": {
      "web": {
        "title": "Frontend Developer",
        "subtitle": "Web Development",
        "period": "Apr 2025 – Jun 2025",
        "description": "Development and maintenance of critical web applications for the business, utilizing React.js, Next.js, and TypeScript, for systems like Pigz Comanda, Pigz Kiosk, and Pigz Desktop Management. Focused on delivering robust and performant solutions.",
        "highlights": [
          "Technical leadership in resolving critical production hotfixes, ensuring rapid recovery and operational continuity of the platform, minimizing impact on users and business.",
          "Recognized for autonomy and accelerated adaptation to new technologies, such as Redux and Context API, being one of the team members with the best initial learning curve.",
          "Active participation in Scrum ceremonies (Daily, Sprint Review), utilizing Jira and Google Workspace, contributing to daily deployments and an agile and efficient workflow.",
          "Continuous contribution to code reviews, technical documentation, and version control via GitHub, ensuring the quality, scalability, and maintainability of the codebase.",
          "Implemented performance optimizations in complex dashboards and management interfaces, resulting in faster loading times and improved usability for clients and collaborators."
        ]
      },
      "mobile": {
        "title": "Mobile Developer",
        "subtitle": "React Native",
        "period": "Feb 2025 – Apr 2025",
        "description": "Development of robust mobile applications using React Native, with a focus on performance, scalability, and an excellent user experience on both iOS and Android devices.",
        "highlights": [
          "Implemented complex functionalities with React Native and TypeScript, ensuring clean, maintainable code adhering to market standards.",
          "Managed robust state using Redux, improving application maintainability and predictability in highly complex scenarios.",
          "Actively participated in code reviews, promoting high-quality code standards, technical collaboration, and the dissemination of mobile development best practices.",
          "Optimized performance and user experience in critical mobile applications for the business, resulting in increased user engagement and satisfaction.",
          "Efficiently integrated RESTful APIs and third-party services to expand mobile application capabilities, ensuring seamless connectivity and functionality."
        ]
      }
    },
    "r2t": {
      "junior": {
        "title": "Junior Frontend Developer",
        "subtitle": "Web Development",
        "period": "Jul 2022 – Dec 2022",
        "description": "Acted as a Junior Frontend Developer, focused on building dynamic and responsive web systems with React.js, Next.js, and JavaScript, prioritizing responsiveness, accessibility, and usability for the end-user.",
        "highlights": [
          "Led the upgrade of a project to the latest version of Next.js, resulting in significant performance improvements, validated by Google Lighthouse metrics.",
          "Received internal recognition as a Next.js reference, leading a high-visibility and strategic impact project, contributing to the company's technological evolution.",
          "Directly collaborated with designers on visual architecture and UI/UX optimization, ensuring design fidelity and continuous refinement of the final product.",
          "Implemented Storybook for component documentation and definition of component systems, aiming for effective frontend scalability and maintenance.",
          "Mentored interns, sharing knowledge on development best practices, design patterns, and agile methodologies, contributing to team growth."
        ]
      },
      "intern": {
        "title": "Frontend Development Intern",
        "subtitle": "Web Development",
        "period": "Feb 2022 – Jul 2022",
        "description": "Began career as a Frontend Development Intern, with a focus on practical learning in React, building reusable components, and applying web development best practices.",
        "highlights": [
          "Developed reusable React components with HTML5 and CSS3, following design patterns and ensuring application visual consistency.",
          "Actively collaborated with the design team, using tools like Figma, to ensure faithful interface implementation and enhance user experience.",
          "Participated in Scrum ceremonies and learned agile development methodologies, contributing to a continuous and collaborative delivery cycle.",
          "Actively participated in critical Git rollback operations, demonstrating pragmatism and problem-solving capabilities in production environments.",
          "Contributed to the maintenance and refactoring of legacy code, applying principles of clean code, modularity, and scalability for codebase modernization."
        ]
      }
    }
  },
  "education": {
    "section": {
      "title": "Education",
      "subtitle": "My academic background and professional certifications"
    },
    "ifrr": {
      "technical": {
        "title": "Technical Course in Informatics",
        "subtitle": "Integrated with High School",
        "period": "2019 - 2021",
        "description": "Solid foundation in computer science fundamentals, programming logic, and software development principles. Developed practical skills in programming and understanding of system architecture.",
        "certifications": [
          "Programming Fundamentals",
          "Programming Logic",
          "Computer Architecture",
          "Computer Networks",
          "Databases"
        ]
      }
    },
    "cubos": {
      "backend": {
        "title": "Certified Backend Developer",
        "subtitle": "Cubos Academy",
        "period": "2023",
        "description": "Professional certification in backend development focusing on JavaScript/Node.js. Acquired in-depth knowledge of API architecture, databases, and full-stack development best practices.",
        "certifications": [
          "Node.js Development",
          "RESTful API Architecture",
          "SQL and NoSQL Databases",
          "Authentication and Authorization",
          "Development Best Practices"
        ]
      }
    },
    "senai": {
      "frontend": {
        "title": "Professional Course in Frontend Web Programming",
        "subtitle": "SENAI - National Service of Industrial Learning",
        "period": "2025",
        "description": "Specialization in modern frontend development with React, Next.js, and TypeScript. Deepened knowledge in creating responsive interfaces, performance optimization, and best practices with current frameworks.",
        "certifications": [
          "React and React Hooks",
          "Next.js and SSR/SSG",
          "Advanced TypeScript",
          "Styled Components and TailwindCSS",
          "Performance Optimization and SEO"
        ]
      }
    },
    "senac": {
      "english": {
        "title": "English Course",
        "subtitle": "SENAC - National Commercial Learning Service",
        "period": "2019 - Ongoing",
        "description": "Continuous development of English language proficiency, essential for a software development career. Participating in regular classes to improve technical communication and comprehension in English.",
        "certifications": [
          "Technical Programming Vocabulary",
          "Professional Communication",
          "Technical Documentation Reading",
          "Listening Comprehension"
        ]
      }
    },
    "devclub": {
      "fullstack": {
        "title": "Full Stack JavaScript Formation",
        "subtitle": "Professional Web Development",
        "period": "2022",
        "description": "Complete full stack development training focused on JavaScript. Acquired practical skills in front-end and back-end development, with over 10 portfolio projects and 80+ hours of practical content. Formation that goes from zero to professional level with specialized support.",
        "certifications": [
          "Advanced HTML5 and CSS3",
          "JavaScript Fundamentals and ES6+",
          "React and Front-end Development",
          "Node.js and Back-end Development",
          "Databases and RESTful APIs",
          "Practical Projects for Portfolio"
        ]
      }
    }
  }
}